<?php
class Df_InTime_Data {
	/**
	 * @used-by Df_InTime_Locator::find()
	 * @var array(string => int)
	 */
	public static $regionIds = array(
		'ВИННИЦКАЯ ОБЛАСТЬ' => 22
		,'ВОЛЫНСКАЯ ОБЛАСТЬ' => 23
		,'ДНЕПРОПЕТРОВСКАЯ ОБЛАСТЬ' => 4
		,'ДОНЕЦКАЯ ОБЛАСТЬ' => 5
		,'ЖИТОМИРСКАЯ ОБЛАСТЬ' => 25
		,'ЗАКАРПАТСКАЯ ОБЛАСТЬ' => 7
		,'ЗАПОРОЖСКАЯ ОБЛАСТЬ' => 24
		,'ИВАНО-ФРАНКОВСКАЯ ОБЛАСТЬ' => 6
		,'КИЕВ' => 11
		,'КИЕВСКАЯ ОБЛАСТЬ' => 11
		,'КИРОВОГРАДСКАЯ ОБЛАСТЬ' => 12
		,'ЛУГАНСКАЯ ОБЛАСТЬ' => 14
		,'ЛЬВОВСКАЯ ОБЛАСТЬ' => 15
		,'НИКОЛАЕВСКАЯ ОБЛАСТЬ' => 16
		,'ОДЕССКАЯ ОБЛАСТЬ' => 17
		,'ПОЛТАВСКАЯ ОБЛАСТЬ' => 18
		,'СЕВАСТОПОЛЬ' => 13
		,'КРЫМ АВТОНОМНАЯ РЕСПУБЛИКА' => 13
		,'РОВЕНСКАЯ ОБЛАСТЬ' => 19
		,'СУМСКАЯ ОБЛАСТЬ' => 20
		,'ТЕРНОПОЛЬСКАЯ ОБЛАСТЬ' => 21
		,'ХАРЬКОВСКАЯ ОБЛАСТЬ' => 8
		,'ХЕРСОНСКАЯ ОБЛАСТЬ' => 9
		,'ХМЕЛЬНИЦКАЯ ОБЛАСТЬ' => 10
		,'ЧЕРКАССКАЯ ОБЛАСТЬ' => 1
		,'ЧЕРНИГОВСКАЯ ОБЛАСТЬ' => 2
		,'ЧЕРНОВИЦКАЯ ОБЛАСТЬ' => 3
	);
}


